lifzcn/STM32_IntelligentTrackingTemperatureMeasurementRobot/Project/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MotorDrive1_IN1_Pin GPIO_PIN_2
#define MotorDrive1_IN1_GPIO_Port GPIOA
#define MotorDrive1_IN2_Pin GPIO_PIN_3
#define MotorDrive1_IN2_GPIO_Port GPIOA
#define MotorDrive1_IN3_Pin GPIO_PIN_4
#define MotorDrive1_IN3_GPIO_Port GPIOA
#define MotorDrive1_IN4_Pin GPIO_PIN_5
#define MotorDrive1_IN4_GPIO_Port GPIOA
#define MotorDrive2_IN1_Pin GPIO_PIN_6
#define MotorDrive2_IN1_GPIO_Port GPIOA
#define MotorDrive2_IN2_Pin GPIO_PIN_7
#define MotorDrive2_IN2_GPIO_Port GPIOA
#define MotorDrive2_IN3_Pin GPIO_PIN_0
#define MotorDrive2_IN3_GPIO_Port GPIOB
#define MotorDrive2_IN4_Pin GPIO_PIN_1
#define MotorDrive2_IN4_GPIO_Port GPIOB
#define HCSR505_IO_Pin GPIO_PIN_8
#define HCSR505_IO_GPIO_Port GPIOA
#define HCSR04_TRIG_Pin GPIO_PIN_11
#define HCSR04_TRIG_GPIO_Port GPIOA
#define HCSR04_ECHO_Pin GPIO_PIN_12
#define HCSR04_ECHO_GPIO_Port GPIOA
#define DS18B20_IO_Pin GPIO_PIN_15
#define DS18B20_IO_GPIO_Port GPIOA
#define OUT1_Pin GPIO_PIN_3
#define OUT1_GPIO_Port GPIOB
#define OUT2_Pin GPIO_PIN_4
#define OUT2_GPIO_Port GPIOB
#define OUT3_Pin GPIO_PIN_5
#define OUT3_GPIO_Port GPIOB
#define OUT4_Pin GPIO_PIN_6
#define OUT4_GPIO_Port GPIOB
#define OUT5_Pin GPIO_PIN_7
#define OUT5_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
